app/controllers/main_controller.rb

SELECT `pizzas`.* FROM `pizzas`
---
  def index
  	@pizzas = Pizza.all