app/controllers/pizzas_controller.rb

SELECT `pizzas`.* FROM `pizzas`
---
  def index
    @pizzas = Pizza.all

SELECT `pizzas`.* FROM `pizzas` WHERE `pizzas`.`id` = 1 LIMIT 1
---
  def show
    @pizza = Pizza.find(params[:id])

SELECT `pizzas`.* FROM `pizzas` WHERE `pizzas`.`id` = 1 LIMIT 1
---
  def edit
    @pizza = Pizza.find(params[:id])

INSERT INTO `pizzas` (`name`, `cost`, `mass`, `description`, `diameter`, `created_at`, `updated_at`, `photo_file_name`, `photo_content_type`, `photo_file_size`, `photo_updated_at`) VALUES ('Chesterfied pizza', '11.00', 500, 'This method removes not only child (and other descendant) elements, but also any text within the set of matched elements. This is because, according to the DOM specification, any string of text within an element is considered a child node of that element. Consider the following HTML', 30, '2012-05-26 16:59:33', '2012-05-26 16:59:33', 'pizza-898.jpg', 'image/jpeg', 56347, '2012-05-26 16:59:33')
---
  def create
    @pizza = Pizza.new(params[:pizza])

    respond_to do |format|
      if @pizza.save

SELECT `pizzas`.* FROM `pizzas` WHERE `pizzas`.`id` = 1 LIMIT 1
UPDATE `pizzas` SET `description` = 'If you’ve found yourself on this page, we’re assuming you’re brand new to Git and GitHub. This guide will walk you through the basics and explain a little bit about how everything works along the way.', `updated_at` = '2012-05-26 17:20:33' WHERE `pizzas`.`id` = 1
---
  def update
    @pizza = Pizza.find(params[:id])

    respond_to do |format|
      if @pizza.update_attributes(params[:pizza])